import urllib.request
import json
import os
import random  # Importing the random module
import threading
import requests

snos = """
нос телеграма канала на самом деле не так уж прост. Этот мануалы а именно это часть для ознакомление и как бы для полных нулей. И так приступим, мало есть способов по сносу телеграм, но мы сегодня разберём несколько методов. Естественно снос зависит от тематики канала, если чернуха или что то подобное то отлетает быстро, разберём несколько вариантов


1. Это естественно способом накрутки,тоесть как то это работает мы накручиваем большое количество подписчиков (не меньше 2000-3000), каких нибудь супер дешманских, в интернете их дофигище. Накручиваем ну а далее жалуемся на данный  аккаунт, говорим что чел накрутил и т.д, кидаем жалобы с телефона друга родителей для большей вероятносьи. Что мы получаем канал может быть заблокируют, а может быть и нет. Так что не надо надеется на этот способ ибо он выглядит даже не очень эффективным.

2. Чтоб снести канал нам нужны какие либо нарушения, например оскарбление, кибербуллинг или незаконные услуги, например сватинг, деанон, снос и т.д. 
Короч имеется и мы пишем вот сюда, напочту поддержке Telegram:  DMCA@telegram.org , или же - abuse@telegram.org вот с таким текстом:
Здраствуйте, тех поддержка телеграма.Сегодня, я бы хотел пожаловаться на эту группу @nickname про "деанонимизации",
 в этой группе расспростроняют личную информацию людей, а вот это уже закон.
Также присутсвуют маты.Прощу вас удалить эту группу, 
так как это в правилах запрещено, как док-ва я оставлю ссылку на запись,
 и отправлю вам скрины: " вы скрините все посты связанные с деанонимизации, так же оставляете ссылку на записи. 
Или:
Здравствуйте, данный телеграмм канал:
@nickname
Продает услуги деанонизации личности и сваттинг:
скриншоты прилагаются в письме
Фото с угрозами минирования зданий:
скриншоты
Угрозы и буллинг:
скриншоты
Прошу Вас заблокировать данный аккаунт, за нарушение правил.

3. Ещё один способ. Если канал не большой, мы заходим в лс с владельцом, пишим ему на подобие "Хочу стать админом в вашем канале, есть стаж буду выкладывать посты каждый день, следить за чатом, подписчикам и. Ввёл крупные проекты" и т.д что то типо этого, вы должны как можно больше убедить в своей работе жертву . Наверняка таким одиночным админам, нужна поддержка и как бы все, они ставят вас админом, НО рекомендую сразу ничего не делать так как админ наверняка будет первое время следить за каналом, делаем все потом желательно когда владелец будет спать или ещё где нибудь. Ну вот прошло время и начинаем творить: удаляем посты, подписчиков, спамим постами рекламы или порнухи и т.д.

Ну эти все способы не очень, либо не очень эффективны, а нам нужен 100% снос. Ну естественно кто углублялся в это тему, есть проги репортеры которые стоят завышенных денег, но зато делают свою работу как надо. Ну или есть на некоторых сервисах по накрутке "накрутка жалоб" и естественно за высокую сумму. Как мне известно многие пользуются именно репорт-прогами, ну а например сейчас бесплатных подобных программ нету, ну или есть, но они бесплатные и полная хрень.

Впрочем если есть люди которые используют другие сверхмощные способы, то окей. Лично тут я поделился своими знаниями.






 
"""
print(snos)
